app/Controllers/UsuarioController.php

    public function formCadastra(){
        $data['titulo'] = 'Cadastro de Usuário';
        $data['acao'] = "Inserir";
        $data['msg'] = '';
        $data['erros'] = '';

        $categoriaModel = new \App\Models\CategoriaModel();
        $listaCategorias = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`

    public function cadastrar(){
        $data['titulo'] = 'Cadastro de Usuário';
        $data['acao'] = "Inserir";
        $data['msg'] = '';
        $data['erros'] = '';

        $categoriaModel = new \App\Models\CategoriaModel();
        $listaCategorias = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`