app/Models/CategoriaModel.php

SELECT *
FROM `categoria`
---
    public function listaCategorias(){
        return $this->db
                ->table($this->table)
                ->select()
                ->get()
                ->getResultObject();