app/Models/LoginModel.php

    public function login($post){

    	$login = $this->db
                ->table($this->table)
                ->select()
                ->where('emailUsuario', $post['emailUsuario'])
                ->where('senhaUsuario', md5($post['senhaUsuario']))
                ->get()
                ->getRowObject();
---
SELECT *
FROM `usuario`
WHERE `emailUsuario` = 'admin@admin.com'
AND `senhaUsuario` = 'c20ad4d76fe97759aa27a0c99bff6710'