app/Models/UsuarioModel.php

    public function cadastrar($post){
        return $this->db
        ->table($this->table)
        ->set("nomeUsuario", $post['nomeUsuario'])
        ->set("emailUsuario", $post['emailUsuario'])
        ->set("senhaUsuario", md5($post['senhaUsuario']))
        ->set("idCategoria", $post['idCategoria'])
        ->insert();
---
INSERT INTO `usuario` (`nomeUsuario`, `emailUsuario`, `senhaUsuario`, `idCategoria`) VALUES ('Teste', '123@123.com', '202cb962ac59075b964b07152d234b70', '1')

    public function listaUsuarios(){
        return $this->db
        ->table($this->table)
        ->select("$this->table.*, categoria.nomeCategoria")
        ->join("categoria", "$this->table.idCategoria = categoria.id")
        ->get()
        ->getResultObject();
---
SELECT `usuario`.*, `categoria`.`nomeCategoria`
FROM `usuario`
JOIN `categoria` ON `usuario`.`idCategoria` = `categoria`.`id`

    public function buscaUsuarios($id){
        return $this->db
        ->table($this->table)
        ->select()
        ->where('id', $id)
        ->get()
        ->getRowObject();
---
SELECT *
FROM `usuario`
WHERE `id` = '1'